Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: A formatter that provides localized representations of units and measurements.
ja: 単位と寸法のローカライズされた表現を提供するフォーマッタ。

source: A fully specified object specifier to the receiver within the application.
ja: アプリケーション内部のレシーバへの完全に指定されたオブジェクト指定子。

source: A fully spelled out date or time format.
ja: 完全に綴られた日付または時刻書式設定。

source: A global variable related to zombie objects that in practice has no effect.
ja: 実のところは効果を持たないゾンビオブジェクトに関するグローバル変数。

source: A global variable that can be used to enable debug behavior in your app, such as extra logging.
ja: あなたのアプリの挙動のデバッグ、例えば追加のログ取りなどを可能にするのに使われるグローバル変数。

source: A global variable that determines whether or not the memory of zombie objects is deallocated.
ja: ゾンビオブジェクトのメモリがデアロケートされるかどうかを決定するグローバル変数。

source: A granularity to compare.
ja: 比較する粒度。

source: A graphics coordinate transformation.
ja: 画像座標変換。

source: A hint to the search algorithm to control the method used for searching for dates.
ja: 日付を検索するのに使われるメソッドを制御する検索アルゴリズムへのヒント。

source: A hint to the system of the relative order for purging tagged sets of resources in the bundle.
ja: バンドルの中のタグ付けされた一揃いのリソースを除去するための相対的順序システムに対するヒント。

source: A key decoding strategy defined by the closure you supply.
ja: あなたが提供するクロージャによって定義されるキーデコーディング戦略。

source: A key decoding strategy that converts snake-case keys to camel-case keys.
ja: スネークケースのキーをキャメルケースのキーに変換するキーデコーディング戦略。

source: A key decoding strategy that doesn't change key names during decoding.
ja: デコーディングの間にキー名を変更しないキーデコーディング戦略。

source: A key encoding strategy defined by the closure you supply.
ja: あなたが提供するクロージャによって定義されるキーエンコーディング戦略。

source: A key encoding strategy that converts camel-case keys to snake-case keys.
ja: キャメルケースキーをスネークケースキーに変換するキーエンコーディング戦略。

source: A key encoding strategy that doesn't change key names during encoding.
ja: エンコーディングの間にキー名を変更しないキーエンコーディング戦略。

source: A key in the receiver's property list.
ja: レシーバの持つプロパティリストの中のあるキー。

source: A key in the userinfo dictionary in a NSFile Handle Connection Accepted notification.
ja: NSFile Handle Connection Accepted通知の中のuserinfo辞書の中のキー。

source: A key in the userinfo dictionary in a read Completion Notification and NSFile Handle Read To End Of File Completion.
ja: read Completion NotificationそしてNSFile Handle Read To End Of File Completionの中のuserinfo辞書の中のキー。

source: A key in your application's Help .plist file that identifies the context-sensitive help to return.
ja: あなたのアプリケーションの持つHelp .plistファイルの中のあるキー、それは返されることになるコンテキスト対応ヘルプを識別します。

source: A key that identifies the relationship into which the new class object will be inserted.
ja: そこにおいて新しいオブジェクトが挿入されることになるリレーションシップを識別するキー。

source: A key that identifies the relationship into which to insert the copied object or objects.
ja: コピーされたオブジェクトまたは複数のオブジェクトがそこへと挿入されるところのリレーションシップを識別するキー。

source: A keyed archiver creating an archive.
ja: アーカイブを作成するキー付きアーカイバ。

source: A keyed archiver does not encode class version numbers.
ja: キー付きアーカイバは、クラスバージョン数をエンコードしません。

source: A keyword (a four-character code) that identifies the attribute descriptor to add.
ja: 加えられる属性記述子を識別するキーワード（４文字コード）。

source: A keyword (a four-character code) that identifies the descriptor to add.
ja: 加えられる記述子を識別するキーワード（４文字コード）。

source: A keyword (a four-character code) that identifies the descriptor to obtain.
ja: 入手しようとする記述子を識別するキーワード（４文字コード）。

source: A keyword (a four-character code) that identifies the descriptor to remove.
ja: 除去する記述子を識別するキーワード（４文字コード）。

source: A keyword (a four-character code) that identifies the parameter descriptor to add.
ja: 加えられるバラメータ記述子を識別するキーワード（４文字コード）。

source: A keyword (a four-character code) that identifies the parameter descriptor to obtain.
ja: 入手しようとするパラメータを識別するキーワード（４文字コード）。

source: A keyword (a four-character code) that identifies the parameter descriptor to remove.
ja: 除去されることになるパラメータ記述子を識別するキーワード（４文字コード）。

source: A list descriptor is a descriptor whose data consists of one or more descriptors.
ja: リスト記述子は、それのデータがひとつ以上の記述子から成る記述子です。

source: A list of all the localizations contained in the bundle.
ja: バンドルの中に含まれるローカライゼーション全てのリスト。

source: A list of elements of the new set.
ja: 新しい集合の要素のリスト。

source: A list of eras in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の紀年のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of indexes that together represent the path to a specific location in a tree of nested arrays.
ja: 入れ子にされた配列のツリーの中の特定の位置へのパスを合わせて表すインデックスからなるリスト。

source: A list of longer-named eras in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の伸長名の紀年のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of months in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の月のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of quarter names in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の四半期名のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of shorter-named months in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の短縮名の月のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of shorter-named quarters in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の短縮名の四半期のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of shorter-named standalone months in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の短縮名の単独動作型の月のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of shorter-named standalone quarters in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の短縮名の単独動作型の四半期のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of shorter-named standalone weekdays in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の短縮名の単独動作型の曜日のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of shorter-named weekdays in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の短縮名の曜日のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of standalone months in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の単独動作型の月のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of standalone quarter names in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の単独動作型の四半期名のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of standalone weekday names in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の単独動作型の曜日名のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of very-shortly-named months in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の超短縮名の月のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of very-shortly-named standalone months in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の超短縮名の単独動作型の月のリスト、Calendarの持つlocaleにローカライズされます。

source: A list of very-shortly-named weekdays in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の超短縮名の曜日のリスト、Calendarの持つlocaleにローカライズされています。

source: A list of weekdays in this calendar, localized to the Calendar’s locale.
ja: このカレンダーの中の曜日のリスト、Calendarの持つlocaleにローカライズされます。

source: A localized date format string representing the date format components given in template, arranged appropriately for the locale specified by locale.
ja: templateにおいて与えられる日付書式設定構成要素を表している、ローカライズされた日付書式設定文字列、localeによって指定されるロケールに対して適切に整えられます。

source: A localized string representation of date using the specified date and time styles.
ja: 指定された日付と時刻スタイルを使っているdateのローカライズされた文字列表現。

source: A localized string representing the given unit.
ja: 与えられた単位を表しているローカライズされた文字列。

source: A localized string representing the unit.
ja: 単位を表しているローカライズされた文字列。

source: A localized string suitable for displaying to users that describes the specified status code.
ja: ユーザに表示するのに適したローカライズされた文字列、それは指定された状態コードを記述します。

source: A localized string that combines the provided value and unit.
ja: 提供された値と単位を組み合わせるローカライズされた文字列。

source: A long length date or time format.
ja: 長い長さの日付または時刻書式設定。

source: A mapping closure.
ja: マップを行うクロージャ。

source: A mask to specify options to use for converting the receiver’s contents to encoding (if conversion is necessary).
ja: レシーバの内容をencodingへ変換するために使うオプションを指定するマスク（もし変換が必要ならば）。

source: A mechanism for converting one kind of scripting data to another.
ja: ある種のスクリプティングデータを別のものに変換するための仕組み。

source: A mechanism for registering handler routines for specific types of Apple events and dispatching events to those handlers.
ja: 特定の型のアップルイベント用のハンドラールーチンを登録する、そして様々なイベントをそれらのハンドラーへ発送する仕組み。

source: A medium length date or time format.
ja: 中ぐらいの長さの日付または時刻書式設定。

source: A minute or count of minutes.
ja: 分または数え分。

source: A mirror that reflects the calendar.
ja: カレンダーを反映するミラー。

source: A mirror that reflects the data.
ja: データを反映するミラー。

source: A mirror that reflects the date interval.
ja: 日付間隔を反映するミラー。

source: A mirror that reflects the date.
ja: 日付を反映するミラー。

source: A mirror that reflects the index path.
ja: インデックスパスを反映するミラー。

source: A mirror that reflects the index set.
ja: インデックス集合を反映するミラー。

source: A month or count of months.
ja: ある月または数え月。

source: A mutable collection you use to temporarily store transient key-value pairs that are subject to eviction when resources are low.
ja: リソースが生であるとき立ち退きを免れない一時的なキー値ペアを仮に格納するためにあなたが使う、可変コレクション。

source: A mutable data object containing bytes that can be discarded when they're no longer needed.
ja: それらがもはや必要とされない時に放棄可能であるバイトを含んでいる可変のデータオブジェクト。

source: A mutable string object that also contains attributes (such as visual style, hyperlinks, or accessibility data) associated with various portions of its text content.
ja: 可変文字列オブジェクト、それはまたそれのテキスト内容の様々な部分と結び付けられる属性（視覚形式、ハイパーリンク、またはアクセシビリティ・データなど）を含みます。

source: A mutable, unordered collection of distinct objects that may appear more than once in the collection.
ja: コレクションの中で複数回現れるかもしれない別個のオブジェクトからなる可変の、順番付けられないコレクション。

source: A nanosecond or count of nanoseconds.
ja: ナノ秒または数えナノ秒。

source: A negative value means the receiver will be earlier than date.
ja: 負の値は、レシーバがdateより早いことを意味します。

source: A network service browser that finds published services on a network using multicast DNS.
ja: マルチキャストDNSを使ってネットワー上で公開されるサービスを見つけるネートワークサービスブラウザ。

source: A network service that broadcasts its availability using multicast DNS.
ja: マルチキャストDNSを使ってそれの利用可能なものを放送するネットワークサービス。

source: A new Date, or nil if a date could not be found which matches the components.
ja: 新しいDate、構成要素それらに合致する日付が見つけられなかったならばnil。

source: A new Date Interval if the starting time and duration of a component could be calculated; otherwise, nil.
ja: 新しいDate Interval、もし開始時間と構成要素からなる継続期間が計算可能であったならば；そうでなければ、nil。

source: A new array containing the receiving array’s elements that fall within the limits specified by range.
ja: 受け手側の配列が持つ要素を含んでいる新しい配列、それはrangeによって指定される限度内に収まるものです。

source: A new array including the first count objects from objects.
ja: objectsから最初のcount個のオブジェクトを含んでいる新しい配列。

source: A new array that is a copy of the receiving array with an Object added to the end.
ja: 新しい配列、それはan Objectがその終わりに追加された受け手側の配列のコピーです。

source: A new array that is a copy of the receiving array with the objects contained in other Array added to the end.
ja: 新しい配列、それは受け手側の配列のコピーで、other Arrayに含まれるオブジェクトがその終わりに追加されたものです。

source: A new block operation object.
ja: 新しいブロック演算オブジェクト。

source: A new date, or nil if a date could not be calculated with the given input.
ja: 新しい日付、または与えられた入力を使って日付が計算できなかったならばnil。

source: A new dimensional unit with the specified symbol and unit converter.
ja: 指定されたシンボルと単位コンバータを持つ新しい寸法の単位。

source: A new instance of the receiver.
ja: レシーバ（受取り手）の新しいインスタンス。

source: A new map table in allocated in zone.
ja: zoneの中にアロケートされる新しいマップテーブル。

source: A new object that’s an exact copy of an Object, or nil if object is nil or if object could not be copied.
ja: an Objectの厳密コピーである新しいオブジェクト、またはnil、もしobjectがnilならば、またはobjectがコピーできなかったならば。

source: A new option set made up of the elements contained in this set, in other, or in both.
ja: この集合の中に、otherの中に、または両方の中に含まれる要素から作り上げられるオプションセット。

source: A new option set with only the elements contained in both this set and other.
ja: この集合とotherの両方に含まれる要素のみをもつ新しいオプションセット。

source: A new option set with only the elements contained in either this set or other, but not in both.
ja: この集合またはotherのどちらかに、しかし両方にではなく含まれる要素のみをもつ新しいオプションセット。

source: A new set.
ja: 新しい集合。

source: A new transform object initialized with the matrix values of a Transform.
ja: a Transformの行列の値で初期化された新しい変換オブジェクト。

source: A newly allocated array including the first count objects from objects.
ja: objectsから最初のcount個のオブジェクトを含んでいる新しく割り当てされた配列。

source: A newly created data buffer that is shorter by the given amount than the original.
ja: 新しく作成されたデータバッファ、それは与えられたamountの分だけオリジナルより少ないです。

source: A no-longer-used global variable related to keeping statistics.
ja: 統計管理に関するもはや使われないグローバル変数。

source: A nonstable sort may change the relative order of elements for which are In Increasing Order does not establish an order.
ja: 安定ではないソートは、それに対してare In Increasing Orderが順序を確立しない要素らの相対順序を変更するかもしません。

source: A nonstable sort may change the relative order of elements that compare equal.
ja: 安定ではないソートは、等しいと比較される要素らの相対順序を変更するかもしません。

source: A notification dispatch mechanism that enables the broadcast of notifications across task boundaries.
ja: タスク境界を横切って通知の放送を可能にする通知ディスパッチの仕組み。

source: A notification that lets observers know when classes are dynamically loaded.
ja: クラスが動的にロードされるときにオブザーバに知らせる通知。

source: A number can have many representations; for example, the following table lists several valid representations for the number 100:
ja: ある数は多くの表現を持つことができます；例えば、以下の表は、数100に対するいくつか有効な表現をリストします：

source: A number indicating the outcome of the operation:
ja: 操作の結果を指し示している数：

source: A number of seconds.
ja: 秒数。

source: A number specifying the relative priority of preserving the resources in the group specified by tag.
ja: tagによって指定されるグループの中のリソースを維持する相対優先度を指定しているある数。

source: A numeric quantity labeled with a unit of measure, with support for unit conversion and unit-aware calculations.
ja: 寸法のいち単位でラベルをつけられる数量、単位変換および単位認識計算に対するサポートを持ちます。

source: A path of "/" means the cookie will be sent for all URLs in the domain.
ja: "/"のパスは、クッキーがドメインの中の全てのURLに対して送られるのを意味します。

source: A path string identifying the directory to create.
ja: 作成するディレクトリを識別するパス文字列。

source: A path string indicating the file or directory to remove.
ja: 除去されるファイルまたはディレクトリを指し示しているパス文字列。

source: A path to a directory.
ja: ディレクトリへのあるパス。

source: A path to a file or directory.
ja: ファイルまたはディレクトリへのパス。

source: A pathname.
ja: パス名。

source: A point in a Cartesian coordinate system.
ja: デカルト座標システムの中のある点。

source: A point structure.
ja: ポイント構造体。

source: A pointer to a descriptor that identifies the target application for the Apple event.
ja: このアップルイベントのための目標アプリケーションを識別する記述子へのポインタ。

source: A pointer to a new copy of table, created in zone and containing pointers to the data elements of table.
ja: tableの新しいコピーへのポインタ、zoneの中に作成されて、tableのデータ要素へのポインタを含んでいます。

source: A pointer to a new copy of table, created in zone and containing pointers to the keys and values of table.
ja: tableの新しいコピーへのポインタ、zoneの中に作成されて、tableのキーと値へのポインタを含んでいます。

source: A pointer to a new hash table created in the specified zone.
ja: 指定されたゾーンに作成された新しいハッシュテーブルへのポインタ。

source: A pointer to a variable in which to put the relationship between directory URL and other URL.
ja: directory URLとother URLとの間の関係が置かれることになる変数へのポインタ。

source: A pointer to an NSHashTable created in the default zone.
ja: 省略時のゾーンの中に作成されるNSHashTableへのポインタを返します。

source: A pointer to the AEDesc structure to associate with the descriptor.
ja: この記述子と結びつけられるAEDesc構造体へのポインタ。

source: A pointer to the allocated memory, or NULL if the function is unable to allocate the requested memory.
ja: アロケートされたメモリへのボインタ、または関数が要求されたメモリをアロケートできないならばNULLを返します。

source: A pointer to the buffer you wish to copy the bytes into.
ja: あなたがバイトをそれへとコピーすることを願うバッファへのポインタ。

source: A pointer to the bytes.
ja: それらバイトへのポインタ。

source: A pointer to the memory to copy.
ja: コピーするメモリへのポインタ。

source: A pointer to the top-level error-handling function where you can perform last-minute logging before the program terminates.
ja: トップレベルのエラー処理関数へのポインタ、そこにおいてあなたはプログラムを終わらせる前に最後の瞬間のログを実行できます。

source: A port that represents a BSD socket.
ja: BSDソケットを表すポート。

source: A position of a character or code unit in a string.
ja: 文字列の中のある文字またはコード単位の位置。

source: A positive number indicates the number of bytes read.
ja: 正の数は、読み出されたバイト数を指し示します。

source: A predicate that returns true if its first argument should be ordered before its second argument; otherwise, false.
ja: ある述部、それはそれの最初の引数がそれの２番目の引数の前に並べられるべきならばtrueを返します；そうでなければ、false。

source: A predicate that returns true if its two arguments are equivalent; otherwise, false.
ja: ある述部、それはそれの２つの引数が等しいならばtrueを返します；そうでなければ、false。

source: A predicate used to partition the collection.
ja: コレクションに仕切りをするのに使われる述部。

source: A property omitted from Coding Keys needs a default value in order for its containing type to receive automatic conformance to Decodable or Codable.
ja: Coding Keysから省略されたあるプロパティは、それの含んでいる型がDecodableまたはCodableへの自動的な準拠を受け取るために初期状態の値が必要です。

source: A protocol that enables an object to be encoded and decoded for archiving and distribution.
ja: あるオブジェクトにアーカイブと配布のためにエンコードおよびデコードされることを可能にするプロトコル。

source: A protocol that enables encoding and decoding in a manner that is robust against object substitution attacks.
ja: エンコーディングとデコーディングを、オブジェクト置き換え攻撃に対して強固であるある流儀で可能にするプロトコル。

source: A protocol that objects adopt to support fast enumeration.
ja: それを採用するオブジェクトは高速列挙をサポートするあるプロトコル。

source: A protocol.
ja: あるプロトコル。

source: A proxy for the receiving object
ja: 受け取り手側オブジェクトに対する代理

source: A quarter or count of quarters.
ja: ある四半期または数え四半期。

source: A query that you perform against Spotlight metadata.
ja: あなたがSpotlightメタデータに対して実行する照会。

source: A queue that regulates the execution of a set of operations.
ja: ひとそろいの演算の実行を統制するキュー。

source: A quiet representation of not-a-number.
ja: 非数のクワイエット表現。

source: A range covering all indices in and between range1 and range2.
ja: range1とrange2の間および中の全てのインデックスを対象とする範囲。

source: A range describing the intersection of range1 and range2—that is, a range containing the indices that exist in both ranges.
ja: range1とrange2の交差を記述しているある範囲 — すなわち、範囲の両方に存在しているインデックスを含んでいるある範囲。

source: A range in the data to copy into the buffer.
ja: バッファへとコピーすることになる、データの中のある範囲。

source: A range of integers.
ja: 整数からなる範囲。

source: A range of the collection’s indices.
ja: コレクションのもつインデックスのある範囲。

source: A range within the bounds of the array.
ja: この配列の境界内の範囲。

source: A range within the receiving array’s range of elements.
ja: 受け手側の配列の持つ要素の範囲の内のある範囲。

source: A range.
ja: 範囲。

source: A rectangle.
ja: 矩形。

source: A reference to a Boolean value.
ja: あるブール値への参照。

source: A reference to a map table structure.
ja: マップテーブル構造体への参照。

source: A region-specific localization, followed by a corresponding localization that isn't region-specific, as a fallback
ja: ある地域特有のローカライゼーション、それに続けて相当する地域特有でないローカライゼーションが続きます、予備として。

source: A replacement string from one of a number of replacement checking results.
ja: いくつかの置換チェックの結果の１つからの置換文字列。

source: A replacement string.
ja: 置き換えの文字列。

source: A representation of a Document Type Definition.
ja: ある「文書型定義」の表現。

source: A representation of a node (a file, directory, or symbolic link) in the file system.
ja: ファイルシステムの中のあるノード（あるファイル、ディレクトリ、またはシンボリックリンク）の表現。

source: A representation of a specific point in time that bridges to Date; use NSDate when you need reference semantics or other Foundation-specific behavior.
ja: Dateにブリッジするある特定の時点の表現；あなたが参照意味論や他のFoundation特有の挙動を必要とする場合にNSDateを使ってください。

source: A representation of an individual host on the network.
ja: ネットワーク上の特定のホストの表現。

source: A representation of element, attribute-list, entity, and notation declarations in a Document Type Definition.
ja: 「文書型定義」における要素、属性リスト、エンティティ、そして表記法宣言の表現。

source: A representation of the code and resources stored in a bundle directory on disk.
ja: ディスク上のバンドルディレクトリの中に格納されるコードとリソースの表現。

source: A representation of the state of your app at a moment in time.
ja: 現時点でのあなたのアプリの状態の表現。

source: A return by-reference error that specifies any error in loading the script.
ja: スクリプトのロードにおけるあらゆるエラーを特定する「参照による」エラーを返します。

source: A sandboxed application may read from, but not write to, this folder.
ja: サンドボックスアプリケーションは、このフォルダから読み込みます、しかしそれへと書き込むことはできません。

source: A scaling factor of 1.0 scales the content to exactly the same size.
ja: 1.0の拡大縮小因数は、コンテンツを正確に同じサイズに拡大縮小します。

source: A script command that a macOS app supports.
ja: macOSアプリがサポートするスクリプトコマンド。

source: A scriptable class that a macOS app supports.
ja: あるmacOSアプリがサポートする、あるスクリプト対応クラス。

source: A second or count of seconds.
ja: 秒または数え秒。

source: A selector that identifies the method to use to compare two elements at a time.
ja: ２つの要素を同時に比較するために使うメソッドを識別するセレクタ。

source: A selector that specifies the method to perform the coercion.
ja: 強制を実行するためのメソッドを指定するセレクタ。

source: A selector that the notification center sends notification Observer to notify when posting the notification.
ja: 通知を投函するとき、通知センターがnotification Observerに送って通知する、セレクタ。

source: A selector.
ja: セレクタ。

source: A self-contained scripting statement.
ja: 自己充足のスクリプト文。

source: A sequence containing the same elements as this sequence, but on which some operations, such as map and filter, are implemented lazily.
ja: このシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence of pairs enumerating the sequence.
ja: このシーケンスを列挙している、ペアからなるあるシーケンス。

source: A sequence to compare to this sequence.
ja: あるシーケンス、このシーケンスと比べることになります。

source: A sequence to insert between each of this sequence’s elements.
ja: このシーケンスの要素それぞれの間に挿入されるシーケンス。

source: A server that your app uses to provide a spell checker service to other apps running in the system.
ja: あなたのアプリがスペルチェッカーサービスをシステムで動作している他のアプリに対して提供するために使用するサーバー。

source: A service that provides a custom communication channel between your app and a File Provider extension.
ja: あなたのアプリとファイルプロバイダ拡張との間のあつらえの通信経路を提供するサービス。

source: A set of Unicode character values for use in search operations.
ja: 検索操作で使われるためのユニコード文字値の集合。

source: A set of the same type as the current set.
ja: 現在の集合と同じ型の集合。

source: A set of values to add to the date.
ja: 日付に加える一揃いの値。

source: A set set of tag names specifying resources stored in the bundle.
ja: バンドルの中に格納されるリソースを指定しているタグ名の一揃い。

source: A set.
ja: １つの集合。

source: A shared instance of this class coerces (converts) object values to objects of another class using information supplied by classes that register with it.
ja: このクラスの共有インスタンスは、オブジェクト値を別のクラスのオブジェクトへと、それに登録するいくつかのクラスによって提供される情報を使って、強制（変換）されます。

source: A signed integer value type.
ja: 符号付き整数値型。

source: A simple tabular Islamic calendar using the astronomical/Thursday epoch of CE 622 July 15
ja: 単純に表で算出したイスラム暦、天文／火曜日 元期 CE622 6月 15日を使います

source: A single component to add.
ja: 加えることになるある単一の構成要素。

source: A single localization that isn't region-specific
ja: 単一の地域特有でないローカライゼーション

source: A single name-value pair from the query portion of a URL.
ja: URLのクエリ部分からの単一の名前値のペア。

source: A singleton object (shared instance) that manages storage of cookies.
ja: シングルトンオブジェクト（共有インスタンス）それはクッキーのストレージを管理します。

source: A singleton object used to represent null values in collection objects that don’t allow nil values.
ja: nil値を許可されないコレクションオブジェクトにおいてnull値を表すために使われるシングルトンオブジェクト。

source: A slice of a string.
ja: ある文字列のスライス。

source: A snapshot of a file at a specific point in time.
ja: 特定の時点でのあるファイルのスナップショット。

source: A sorted array of the collection’s elements.
ja: コレクションのもつ要素からなるソートされた配列。

source: A sorted array of the sequence’s elements.
ja: このシーケンス要素のソート済み配列。

source: A sorted version of an Array is created in this way:
ja: an Arrayのソートされたバージョンは、この方法で作成されます：

source: A specialized error that may be recoverable by presenting several potential recovery options to the user.
ja: いくつかの可能性のある回復選択肢をユーザに提示することによって回復されるかもしれないある特殊化されたエラー。
